package com.ranis.homeworknumbertwo

object ClubRepository {
    val clubs: List<Club> = listOf(
        Club(
            id = 0,
            name = "Real Madrid",
            country = "Spain",
            "https://avto-nakleyki66.ru/uploads/product/1981/loupe.png",
            info = "«Реал Мадрид» — испанский профессиональный футбольный клуб из города Мадрид.\n" +
                    "Основан 6 марта 1902 года.\n" +
                    "Признан ФИФА лучшим футбольным клубом XX века.",
            league = "Чемпионат Испании",
        ),
        Club(
            id = 1,
            name = "Barcelona",
            country = "Spain",
            "https://1.allegroimg.com/original/0153fe/2a13807144f7af9915af1621d261/Naklejki-pilkarskie-FC-BARCELONA-na-sciane-100cm",
            info = "«Барселона» — испанский профессиональный футбольный клуб из одноимённого города.\n" +
                    "Основан в 1899 году группой швейцарских, британских, испанских и каталонских футболистов во главе с Жоаном Гампером.",
            league = "Чемпионат Испании",
        ),
        Club(
            id = 2,
            name = "Manchester City",
            country = "England",
            "https://sun9-60.userapi.com/impg/QRJ6wjM3NiQDx6Q-7PeMkrg6-08k1iMG4iqh8g/6pcYfuo4Ch4.jpg?size=604x604&quality=96&sign=4c90d7532ac90d1de15df924ff6ac0f5&type=album",
            info = "Футбольный клуб \"Манчестер Сити\" - профессиональный футбольный клуб, базирующийся в Манчестере, Англия. Клуб выступает в Премьер-лиге, высшем эшелоне английского футбола. Основанный в 1880 году как \"Сент-Маркос\" (Западный Гортон), они стали футбольным клубом ассоциации \"Ардвик\" в 1887 году и \"Манчестер Сити\" в 1894 году.",
            league = "Чемпионат Англии",
        ),
        Club(
            id = 3,
            name = "Bayern Munich",
            country = "German",
            "https://img.staticdj.com/3258aa6b7b8b5d1a3676b60092e898c3.jpeg",
            info = "«Бавария» — немецкий футбольный клуб из города Мюнхен. Основан в 1900 году.\n" +
                    "\n" +
                    "Самый титулованный клуб Германии и один из самых титулованных клубов мира. На его счету 33 чемпионских титула и 20 Кубков Германии, 6 побед в Лиге чемпионов.",
            league = "Чемпионат Германии",
        ),
        Club(
            id = 4,
            name = "Chelsea",
            country = "England",
            "https://yt3.googleusercontent.com/GGZ9lF6Dj-EI9HCss0I_G1AXGrhzIoGtoA1iR3qSRe2toKEsOY7wq_3meKGJUNcxbSwn2Ig3=s900-c-k-c0x00ffffff-no-rj",
            info = "Футбольный клуб \"Челси\" - профессиональный футбольный клуб, базирующийся в Фулхэме, Западный Лондон, Англия. Клуб выступает в Премьер-лиге, высшем эшелоне английского футбола. Команда, основанная в 1905 году, проводит домашние матчи на \"Стэмфорд Бридж\".",
            league = "Чемпионат Англии",
        ),
        Club(
            id = 5,
            name = "PSG",
            country = "France",
            "https://www.pngmart.com/files/23/Psg-Logo-PNG-Photo.png",
            info = "Футбольный клуб \"Пари Сен-Жермен\" обычно называемый Пари Сен-Жермен или просто ПСЖ, является профессиональным футбольным клубом, базирующимся в Париже, Франция. Они выступают в Лиге 1, высшем дивизионе французского футбола.",
            league = "Чемпионат Франции",
        ),
        Club(
            id = 6,
            name = "Borussia Dortmund",
            country = "German",
            "https://mychamp.ru/system/clubs/11024/large.png",
            info = "«Боруссия» — профессиональный немецкий футбольный клуб из города Дортмунд, земля Северный Рейн-Вестфалия.\n" +
                    "Основан в 1909 году. Выступает в Бундеслиге — высшем дивизионе в системе футбольных лиг Германии.",
            league = "Чемпионат Германии",
        )
    )
}